#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/whip-up/csharp-clean-architecture-github-action/runs/run-BePQ5qTShghc3Lxv

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
data.aws_vpc.this: Refreshing...
aws_ecr_repository.dot-net-architecture: Refreshing state... [id=clean-slice]
aws_ecs_cluster.this: Refreshing state... [id=arn:aws:ecs:ap-southeast-2:467945566648:cluster/clean-slice-cluster]
aws_iam_role.task_execution: Refreshing state... [id=terraform-20230515052253488900000001]
aws_iam_role_policy_attachment.task[0]: Refreshing state... [id=terraform-20230515052253488900000001-20230515052254248900000002]
data.aws_vpc.this: Refresh complete after 2s [id=vpc-d23709b5]
data.aws_subnets.this: Refreshing...
aws_security_group.this: Refreshing state... [id=sg-0e1ef5e8e637d4a4f]
aws_lb_target_group.this: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:467945566648:targetgroup/clean-slice-lb-tg/a08d81c514673f11]
data.aws_subnets.this: Refresh complete after 0s [id=ap-southeast-2]
aws_lb.this: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:467945566648:loadbalancer/app/clean-slice-alb/0d8a0f9701063a6c]
aws_lb_listener.this: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:467945566648:listener/app/clean-slice-alb/0d8a0f9701063a6c/c9d5eeafad5c649b]
aws_lb_listener_rule.this: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:467945566648:listener-rule/app/clean-slice-alb/0d8a0f9701063a6c/c9d5eeafad5c649b/5a284721b4302296]
aws_ecs_service.ecs_service: Refreshing state... [id=arn:aws:ecs:ap-southeast-2:467945566648:service/clean-slice-cluster/clean-slice]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecs_task_definition.initiator will be created
  + resource "aws_ecs_task_definition" "initiator" {
      + arn                      = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + essential        = true
                  + image            = "nginxdemos/hello:0.3"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-create-group  = "true"
                          + awslogs-group         = "clean-slice-task"
                          + awslogs-region        = "ap-southeast-2"
                          + awslogs-stream-prefix = "clean-slice"
                        }
                    }
                  + name             = "clean-slice"
                  + portMappings     = [
                      + {
                          + containerPort = 80
                          + hostPort      = 80
                          + protocol      = "tcp"
                        },
                    ]
                },
            ]
        )
      + cpu                      = "256"
      + execution_role_arn       = "arn:aws:iam::467945566648:role/terraform-20230515052253488900000001"
      + family                   = "clean-slice-task"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = {
          + "Environment" = "Production"
          + "Service"     = "clean-slice"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + aws_ecs_init_task_definition_arn = (known after apply)

```

</details>

*Pushed by: @jonyeezs*